7767517
4 4
Input           grid    0 1 grid 0=6 1=10 2=96
Input           guide   0 1 guide 0=60 1=101
Input           input   0 1 input 0=60 1=101 2=3
BilateralSlice  bislice 3 1 grid guide input bislice 0=1 1=8
